blog-hugo/content/posts/blog.org
#+HUGO_BASE_DIR: ~/code/web/website/blog-hugo
#+HUGO_SECTION: posts
#+hugo_front_matter_format: yaml
#+STARTUP: content

** TODO ox-hugo is pretty nice :hugo:blogs:org:
:PROPERTIES:
:EXPORT_FILE_NAME: ox-hugo
:EXPORT_DATE: 2022-03-03
:END:
I _have_ been meaning to move over to using org for my blogging and ox-hugo is a
pretty nice, there are some snags but they are pretty minor and now its pretty
seamless and quite _enjoyable_.
*** The Problem
As I discussed in my post on why I don't write as much, one problem I had was
markdown, for anything non trivial its kinda a pain and I would rather be in org
