blog-hugo/content/posts/ox-hugo.md
---
title: "ox-hugo is pretty nice"
date: 2022-03-03
tags: ["hugo", "blogs", "org"]
draft: true
---

I <span class="underline">have</span> been meaning to move over to using org for my blogging and ox-hugo is a
pretty nice, there are some snags but they are pretty minor and now its pretty
seamless and quite <span class="underline">enjoyable</span>.


## The Problem {#the-problem}

As I discussed in my post on why I don't write as much, one problem I had was
markdown, for anything non trivial its kinda a pain and I would rather be in org
